#include <stdio.h>
#include <stdlib.h>

int main () {
    int str = 10, stl = 20;
    int arr[str][stl];
    
    printf("Массив изначальный:\n");
    printf("---------------------------------------------------------------------------------\n");
    
    for (int i = 0; i < str; i++) {
        for (int j = 0; j < stl; j++) {
            arr[i][j] = rand() % 10;
            printf("| %d ", arr[i][j]);
        }
        printf("|\n");
    }
    
    printf("---------------------------------------------------------------------------------\n");

    for (int i = 0; i <= str - 2; i += 2) {
        for(int j = 0; j < stl; j++) {
            int a;
            a = arr[i][j];
            arr[i][j] = arr[i + 1][j];
            arr[i + 1][j] = a;
        }
    }

    printf("Изменены строки:\n");
    printf("---------------------------------------------------------------------------------\n");
    
    
    for (int i = 0; i < str; i++) {
        for (int j = 0; j < stl; j++) {
            printf("| %d ", arr[i][j]);
        }
        printf("|\n");
    }

    printf("---------------------------------------------------------------------------------\n");
}
